In [2]:
import pandas as pd

In [4]:
my_key = 'AIzaSyDd4uWCZ6k0qj5HNIh-iMbcAQhejUpAyrA'

In [6]:
df1 = pd.read_csv('../Data/read_csv_sample.csv')
df1

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [11]:
df1 = pd.read_csv('../Data/read_csv_sample.csv', index_col='c1')
df1

    c0  c2  c3
c1
1    0   4   7
2    1   5   8
3    2   6   9

In [16]:
#!pip install openpyxl

In [17]:
# Excel
df2 = pd.read_excel('../data/남북한발전전력량.xlsx')
df2

# excel 에서 셀병합 시킨거는 NaN 값으로 들어옴

,전력량 (억㎾h),발전 전력별,1990,1991,1992,1993,1994,1995,1996,1997,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,남한,합계,1077,1186,1310,1444,1650,1847,2055,2244,...,4031,4224,4336,4747,4969,5096,5171,5220,5281,5404
1,NaN,수력,64,51,49,60,41,55,52,54,...,50,56,56,65,78,77,84,78,58,66
2,NaN,화력,484,573,696,803,1022,1122,1264,1420,...,2551,2658,2802,3196,3343,3430,3581,3427,3402,3523
3,NaN,원자력,529,563,565,581,587,670,739,771,...,1429,1510,1478,1486,1547,1503,1388,1564,1648,1620
4,NaN,신재생,-,-,-,-,-,-,-,-,...,-,-,-,-,-,86,118,151,173,195
5,북한,합계,277,263,247,221,231,230,213,193,...,236,255,235,237,211,215,221,216,190,239
6,NaN,수력,156,150,142,133,138,142,125,107,...,133,141,125,134,132,135,139,130,100,128
7,NaN,화력,121,113,105,88,93,88,88,86,...,103,114,110,103,79,80,82,86,90,111
8,NaN,원자력,-,-,-,-,-,-,-,-,...,-,-,-,-,-,-,-,-,-,-

In [18]:
#Json
df3 = pd.read_json('../Data/read_json_sample.json')
df3

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

In [6]:
#!pip install lxml
#!pip install html5lib

Collecting html5lib
  Downloading html5lib-1.1-py2.py3-none-any.whl (112 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 112.2/112.2 kB 4.6 MB/s eta 0:00:00
Requirement already satisfied: six>=1.9 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from html5lib) (0.5.1)
Installing collected packages: html5lib
Successfully installed html5lib-1.1

In [3]:
#Html
df4 = pd.read_html('../Data/sample.html')
df4

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [4]:
df5 = df4[1]
df5

         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [5]:
df5.set_index('name',inplace=True)
df5

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

### Google Geocoging
- 장소 이름 또는 주소를 입력하면 위와 경도 좌표 정보를 변해 주는 서비스
- API 키를 발급 받아야 사용가능하며, 등록시 신용카드 정보가 필요하므로 무료 사용량을 초과하면 요금을 지불해야 하는 상황이 발생

### Google Geocoding 발급 절차
- 구글 지도 서비스(https://mapsplatform.google.com/maps-products/?hl=ko ) 접속
- 새 프로젝트 만들기 (무료 평가판은 사용가능하지만 신용카드 정보 등록 필요)
- API 설정
- 사용자 인증
- API key 발급

In [1]:
#!pip install googlemaps

Collecting googlemaps
  Downloading googlemaps-4.9.0.tar.gz (32 kB)
  Preparing metadata (setup.py) ... done
Requirement already satisfied: requests<3.0,>=2.20.0 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from googlemaps) (2.28.2)
Requirement already satisfied: idna<4,>=2.5 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (3.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (1.26.14)
Requirement already satisfied: certifi>=2017.4.17 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (2022.12.7)
Requirement already satisfied: charset-normalizer<4,>=2 in /Users/luchesia/miniforge3/envs/tensorflow/lib/python3.9/site-packages (from requests<3.0,>=2.20.0->googlemaps) (3.0.1)
Building wheels for collected packages: googlemaps
  Building wheel for googlemaps (setup.py) ... done
  Created wheel for googlemaps: filename=googlemaps-4.9.0-py3-none-any.whl size=40431 sha256=9eac5c0c24cf2d6e242e3a1c33696a3dac836691495c46f89f40f501d937b58e
  Stored in directory: /Users/luchesia/Library/Caches/pip/wheels/d4/82/ed/600f40f64a9692a4f7a2ee7a8d7b8d37d77a43ddc7374a6a85
Successfully built googlemaps
Installing collected packages: googlemaps
Successfully installed googlemaps-4.9.0

In [ ]:
Project Dementia Google API key : 위에 my_key 로 만들어놓음 
 평가판 기간 2023-02-01 까지

In [5]:
import googlemaps

In [24]:
# 구글 맵스 객체 생성하기
maps = googlemaps.Client(key=my_key)
lat = []
lng = []
errorList=[]

In [7]:
maps.geocode("서울시청")

[{'address_components': [{'long_name': 'Seoul',
    'short_name': 'Seoul',
    'types': ['administrative_area_level_1', 'political']},
   {'long_name': 'South Korea',
    'short_name': 'KR',
    'types': ['country', 'political']}],
  'formatted_address': 'Seoul, South Korea',
  'geometry': {'bounds': {'northeast': {'lat': 37.7017495, 'lng': 127.1835899},
    'southwest': {'lat': 37.4259627, 'lng': 126.7645827}},
   'location': {'lat': 37.566535, 'lng': 126.9779692},
   'location_type': 'APPROXIMATE',
   'viewport': {'northeast': {'lat': 37.7017495, 'lng': 127.1835899},
    'southwest': {'lat': 37.4259627, 'lng': 126.7645827}}},
  'partial_match': True,
  'place_id': 'ChIJzzlcLQGifDURm_JbQKHsEX4',
  'types': ['administrative_area_level_1', 'political']}]

In [14]:
maps.geocode("서울시청")[0].get('geometry')

{'bounds': {'northeast': {'lat': 37.7017495, 'lng': 127.1835899},
  'southwest': {'lat': 37.4259627, 'lng': 126.7645827}},
 'location': {'lat': 37.566535, 'lng': 126.9779692},
 'location_type': 'APPROXIMATE',
 'viewport': {'northeast': {'lat': 37.7017495, 'lng': 127.1835899},
  'southwest': {'lat': 37.4259627, 'lng': 126.7645827}}}

In [15]:
maps.geocode("서울시청")[0].get('geometry')['location']

{'lat': 37.566535, 'lng': 126.9779692}

In [16]:
# test
maps.geocode("서울시청")[0].get('geometry')['location']['lat']

37.566535

In [17]:
# test
maps.geocode("서울시청")[0].get('geometry')['location']['lng']

126.9779692

In [27]:
# 장소(또는 주소) 리스트

places = ['서울시청','국립국악원','해운대해수욕장']

i = 0
for place in places:
    i += 1
    try:
        print(f'{i} : {place} ')
        geo_location = maps.geocode(place)[0].get('geometry')
    except:
        lat.append('None')
        lng.append('None')
        errorList.append(f'{i} 번째 Error ')
    else :
        lat.append(geo_location['location']['lat'])
        lng.append(geo_location['location']['lng'])

1 : 서울시청
2 : 국립국악원
3 : 해운대해수욕장

In [28]:
lat

[37.566535, 37.4777592, 35.1586975]

In [29]:
lng

[126.9779692, 127.0083043, 129.1603842]

In [30]:
# Make dataframe
df = pd.DataFrame({'위도': lat, '경도':lng}, index= places)
df

                위도          경도
서울시청     37.566535  126.977969
국립국악원    37.477759  127.008304
해운대해수욕장  35.158698  129.160384

---
Save Data

In [31]:
data = {'name' : [ 'Jerry', 'Riah', 'Paul'],
        'algol' : [ "A", "A+", "B"],
        'basic' : [ "C", "B", "B+"],
        'c++' : [ "B+", "C", "C+"],
        }
data

{'name': ['Jerry', 'Riah', 'Paul'],
 'algol': ['A', 'A+', 'B'],
 'basic': ['C', 'B', 'B+'],
 'c++': ['B+', 'C', 'C+']}

In [34]:
df = pd.DataFrame(data)
df.set_index('name', inplace=True)
df

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

In [35]:
# Save csv

df.to_csv('../Data/df_sample.csv')

In [36]:
# Save Json

df.to_json('../Data/df_sample.json')

In [37]:
# Save Excel
df.to_excel('../Data/df_sample.xlsx')

In [38]:
data2 = {'c0':[1,2,3], 
         'c1':[4,5,6], 
         'c2':[7,8,9], 
         'c3':[10,11,12], 
         'c4':[13,14,15]}
data2

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [43]:
data1 = {'name' : [ 'Jerry', 'Riah', 'Paul'],
        'algol' : [ "A", "A+", "B"],
        'basic' : [ "C", "B", "B+"],
        'c++' : [ "B+", "C", "C+"],
        }
data1
df1 = pd.DataFrame(data1)
df1.set_index('name', inplace=True)
df1

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

In [39]:
df2 = pd.DataFrame(data2)
df2.set_index('c0', inplace=True)
df2

    c1  c2  c3  c4
c0
1    4   7  10  13
2    5   8  11  14
3    6   9  12  15

In [44]:
# df1을 sheet1로, df2 를 sheet2로 저장

writer = pd.ExcelWriter("../Data/df_ExcelWriter.xlsx")
df1.to_excel(writer, sheet_name='sheet1')
df2.to_excel(writer, sheet_name='sheet2')
writer.save()

/var/folders/j9/zr30dj9x51x0cxznxz0064t80000gn/T/ipykernel_821/3625568623.py:6: FutureWarning: save is not part of the public API, usage can give unexpected results and will be removed in a future version
  writer.save()